{
  "slug": "welcome-to-knit-by-machine",
  "title": "Welcome to Knit by Machine",
  "author": "Sue Jalowiec",
  "date": "2024-11-12",
  "publishedDate": "2024-11-12",
  "excerpt": "Discover a new era of machine knitting with streamlined tools, expert guidance, and a community built for makers like you.",
  "description": "Discover a new era of machine knitting with streamlined tools, expert guidance, and a community built for makers like you.",
  "body": "<p>Welcome to <strong>Knit by Machine</strong> — a fresh start for machine knitters who want clarity, confidence, and practical help.</p>\n\n<p>After years of running Knit It Now, I've learned what you need most: <strong>clear answers, reliable tools, and direct support</strong>. That's exactly what KBM delivers.</p>\n\n<h2>What Makes KBM Different</h2>\n\n<p>This isn't just another knitting site. It's a carefully designed platform built around three pillars:</p>\n\n<ul>\n  <li><strong>Ask 'n Answer</strong> — Get fast, expert answers to your toughest knitting questions</li>\n  <li><strong>Smart Guides</strong> — Step-by-step walkthroughs for techniques, troubleshooting, and finishing</li>\n  <li><strong>Interactive Wizards</strong> — Calculators and tools that do the math for you</li>\n</ul>\n\n<h2>A Note to Knit It Now Members</h2>\n\n<p>If you're coming from Knit It Now, thank you for your loyalty. Your current membership remains active through your paid term, and you'll have direct access to me for help and guidance during this transition.</p>\n\n<p>Many of you will receive complimentary access to Knit by Machine so you can explore at your own pace. If you have questions or need anything, just reach out — I'm here for you every step of the way.</p>\n\n<h2>What's Next</h2>\n\n<p>I'm adding new content every week based on what <em>you</em> tell me you need. This platform grows with your feedback, so don't hesitate to let me know what would help you most.</p>\n\n<p>Ready to dive in? Start with the <a href=\"/ana-catalog\">Ask 'n Answer catalog</a> or explore our <a href=\"/wizards-catalog\">interactive wizards</a>.</p>\n\n<p>Happy knitting!<br />\n— Sue</p>",
  "tags": ["getting-started", "announcements", "community"],
  "isDraft": false,
  "pendingPublish": false
}
